Pandas
Widely used for data analysis and data cleaning. It provides two primary data structures: Series and DataFrame.
1. Series: One-dimensional array-like object
2. DataFrame is two-dimensional, size-mutable and potentially heterogenous tabluar data structure with labeled axes.

In [19]:
%pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in /var/data/python/lib/python3.12/site-packages (2.3.1)
Requirement already satisfied: numpy>=1.26.0 in /var/data/python/lib/python3.12/site-packages (from pandas) (2.3.1)
Requirement already satisfied: python-dateutil>=2.8.2 in /var/data/python/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /var/data/python/lib/python3.12/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /var/data/python/lib/python3.12/site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in /usr/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [20]:
import pandas as pd

In [21]:
## series
data=[1,2,3,4,5]
series=pd.Series(data)
series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [22]:
## create series from dictionary
data = {'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
series_dict

a    1
b    2
c    3
dtype: int64

In [23]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [24]:
## dataframe
## create dataframe from a dictionary of list
data={
    'Name':['Krish','Abhipsa','John','Jack'],
    'Age':[25,34,34,5],
    'City':['Bangalore','Prayagraj','New York','Florida']
}

In [25]:
df=pd.DataFrame(data)

In [26]:
df

      Name  Age       City
0    Krish   25  Bangalore
1  Abhipsa   34  Prayagraj
2     John   34   New York
3     Jack    5    Florida

In [27]:
import numpy as np

np.array(data)

array({'Name': ['Krish', 'Abhipsa', 'John', 'Jack'], 'Age': [25, 34, 34, 5], 'City': ['Bangalore', 'Prayagraj', 'New York', 'Florida']},
      dtype=object)

In [28]:
data = [
    {'Name':'Abhipsa','City':'Bengaluru','Age':21},
    {'Name':'Anshika','City':'Dehli','Age':17},
    {'Name':'Alok','City':'Prayagraj','Age':56}
]

In [29]:
df=pd.DataFrame(data)

In [30]:
df

      Name       City  Age
0  Abhipsa  Bengaluru   21
1  Anshika      Dehli   17
2     Alok  Prayagraj   56

In [31]:
df=pd.read_csv('sales_data.csv')

In [32]:
df.head()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [33]:
df.tail()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [34]:
## accesssing data from dataframe
data = [
    {'Name':'Abhipsa','City':'Bengaluru','Age':21},
    {'Name':'Anshika','City':'Dehli','Age':17},
    {'Name':'Alok','City':'Prayagraj','Age':56}
]
df=pd.DataFrame(data)
df

      Name       City  Age
0  Abhipsa  Bengaluru   21
1  Anshika      Dehli   17
2     Alok  Prayagraj   56

In [35]:
df['Name']

0    Abhipsa
1    Anshika
2       Alok
Name: Name, dtype: object

In [37]:
type(df['Age'])

pandas.core.series.Series

In [ ]:
df.loc[0] ## row index

Name      Abhipsa
City    Bengaluru
Age            21
Name: 0, dtype: object

In [41]:
df.iloc[1][0]

/tmp/ipykernel_890/1019881219.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[1][0]

'Anshika'

In [43]:
## accessing specific elements
df['Name']

0    Abhipsa
1    Anshika
2       Alok
Name: Name, dtype: object

In [46]:
df.at[2,'Name']

'Alok'

In [48]:
## accessning a specified elements
df.iat[2,1]

'Prayagraj'

In [49]:
## data manipulation with dataframes
df

      Name       City  Age
0  Abhipsa  Bengaluru   21
1  Anshika      Dehli   17
2     Alok  Prayagraj   56

In [50]:
df['Salary']=[5000000,8000000,94400000]

In [51]:
df

      Name       City  Age    Salary
0  Abhipsa  Bengaluru   21   5000000
1  Anshika      Dehli   17   8000000
2     Alok  Prayagraj   56  94400000

In [57]:
## remove a column
df.drop('Salary',axis=1,inplace=True) ## row=0 && column 1

In [58]:
df

      Name       City  Age
0  Abhipsa  Bengaluru   21
1  Anshika      Dehli   17
2     Alok  Prayagraj   56

In [60]:
## add age to the column
df['Age']=df['Age']+1

In [61]:
df

      Name       City  Age
0  Abhipsa  Bengaluru   22
1  Anshika      Dehli   18
2     Alok  Prayagraj   57

In [64]:
df.drop(0,inplace=True)

In [65]:
df

      Name       City  Age
1  Anshika      Dehli   18
2     Alok  Prayagraj   57

In [66]:
df=pd.read_csv('sales_data.csv')

In [67]:
df

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal
...,...,...,...,...,...,...,...,...,...
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [69]:
df.dtypes

Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object

In [74]:
df.describe() ## stastical summary

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000